In [1]:
import pandas as pd

In [2]:
# Read the csv 
df = pd.read_csv('salaries_by_college_major.csv')

In [3]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

In [4]:
# Shape of the dataset
df.shape

(51, 6)

In [5]:
# Column names
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

In [6]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

In [7]:
# remove the NaN
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

In [8]:
# College with highest starting salary
clean_df["Starting Median Salary"].max()

74300.0

In [10]:
# Index for the row with highest starting salary
clean_df["Starting Median Salary"].idxmax()

43

In [12]:
# Undergraduate Major at the index using .loc
clean_df["Undergraduate Major"].loc[43]

'Physician Assistant'

In [13]:
# Undergraduate Major at the index without using .loc
clean_df["Undergraduate Major"][43]

'Physician Assistant'

In [14]:
# Use .loc to retrive entire row using index
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                             74300
Mid-Career Median Salary                           91700
Mid-Career 10th Percentile Salary                  66400
Mid-Career 90th Percentile Salary                 124000
Group                                               STEM
Name: 43, dtype: object

In [16]:
# Highest Mid career salary
clean_df["Mid-Career Median Salary"].max()

107000.0

In [17]:
# Major with highest Mid Career salary
index = clean_df["Mid-Career Median Salary"].idxmax()
clean_df["Undergraduate Major"][index]

'Chemical Engineering'

In [18]:
# Which college major has the lowest starting salary and how much do graduates earn after university?

min_salary = clean_df["Starting Median Salary"].min()
index = clean_df["Starting Median Salary"].idxmin()

major = clean_df["Undergraduate Major"][index]

print(min_salary)
print(major)

34000.0
Spanish

In [20]:
# Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

min_mid_career_salary = clean_df["Mid-Career Median Salary"].min()

major = clean_df["Undergraduate Major"][clean_df["Mid-Career Median Salary"].idxmin()]

print(min_mid_career_salary)
print(major)

52000.0
Education

In [21]:
# Adding Column in dataframe using .insert()
spread_col = clean_df["Mid-Career 90th Percentile Salary"] - clean_df["Mid-Career 10th Percentile Salary"]
clean_df.insert(1, "Spread", spread_col)
clean_df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

In [22]:
# Sorting the dataframe by lowest spread using .sort_values()
low_risk = clean_df.sort_values("Spread")
low_risk[["Undergraduate Major", "Spread"]].head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

In [25]:
# top 5 degrees with the highest values in the 90th percentile. 
top_degrees = clean_df.sort_values("Mid-Career 90th Percentile Salary", ascending=False)
top_degrees[["Undergraduate Major"]].head()

     Undergraduate Major
17             Economics
22               Finance
8   Chemical Engineering
37                  Math
44               Physics

In [27]:
# find the degrees with the greatest spread in salaries
high_spread = clean_df.sort_values("Spread", ascending=False)
high_spread[["Undergraduate Major"]].head()

   Undergraduate Major
17           Economics
22             Finance
37                Math
36           Marketing
42          Philosophy

In [28]:
# Group By
clean_df.groupby("Group").count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

In [29]:
# Average salary of Group using mean
clean_df.groupby("Group").mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,103958.333333,44633.333333,75083.333333,43566.666667,147525.000000
HASS,95218.181818,37186.363636,62968.181818,34145.454545,129363.636364
STEM,101600.000000,53862.500000,90812.500000,56025.000000,157625.000000

In [31]:
# Change the format of the numbers
pd.options.display.float_format = '{:,.2f}'.format
clean_df.groupby("Group").mean()

,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"103,958.33","44,633.33","75,083.33","43,566.67","147,525.00"
HASS,"95,218.18","37,186.36","62,968.18","34,145.45","129,363.64"
STEM,"101,600.00","53,862.50","90,812.50","56,025.00","157,625.00"